
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВызовПриСоздании();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Тест(Команда)
	
	Переменная1 = 1;
	Переменная2 = 15;
	Структура = Новый Структура();
	Структура.Вставить("Наименование");
	Структура.Вставить("Количество");
	
	
	ИзменитьПеременную(Переменная2, Структура);
	ВызовПриСоздании(Переменная2);
	Сообщить("Привет мир!");	
	
КонецПроцедуры


&НаКлиенте
Процедура КомандаИзДругойВетки(Команда)
	
	Переменная = 1;
	ВыполнитьКомандуИзДругойВетки(Переменная);
	Сообщить("Сообщение");

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИзменитьПеременную(Переменная2, Структура)
	
	Переменная2 = Переменная2 + 5;	
	
КонецПроцедуры

&НаСервере
Процедура ВызовПриСоздании(Переменная2 = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка,
		|	Номенклатура.Наименование
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура";

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Переменная2 = Выборка.Наименование;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыполнитьКомандуИзДругойВетки(Переменная)
	
	Справочники.Номенклатура.НайтиПоНаименованию("Молоко");

КонецПроцедуры

#КонецОбласти

